In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull().sum()

1

In [8]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [10]:
string_data.fillna(0)

0     aardvark
1    artichoke
2            0
3      avocado
dtype: object

In [11]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [12]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [13]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna()

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
cleaned = data.dropna(axis=1)
cleaned

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.451587  1.002686  0.158374
1 -0.463529 -0.178245  0.612536
2  0.250369 -2.076919 -0.874163
3 -0.708129 -2.272121 -0.052392
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [22]:
df.iloc[:4, 1] = NA
df.iloc[:2, 0] = NA

In [23]:
df

          0         1         2
0       NaN       NaN  0.158374
1       NaN       NaN  0.612536
2  0.250369       NaN -0.874163
3 -0.708129       NaN -0.052392
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [26]:
df.dropna()

          0         1         2
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [28]:
df.dropna(thresh=2)

          0         1         2
2  0.250369       NaN -0.874163
3 -0.708129       NaN -0.052392
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [29]:
df

          0         1         2
0       NaN       NaN  0.158374
1       NaN       NaN  0.612536
2  0.250369       NaN -0.874163
3 -0.708129       NaN -0.052392
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [30]:
df.fillna(0)

          0         1         2
0  0.000000  0.000000  0.158374
1  0.000000  0.000000  0.612536
2  0.250369  0.000000 -0.874163
3 -0.708129  0.000000 -0.052392
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [33]:
df.fillna(df.mean())

          0         1         2
0 -0.175309 -0.513653  0.158374
1 -0.175309 -0.513653  0.612536
2  0.250369 -0.513653 -0.874163
3 -0.708129 -0.513653 -0.052392
4  0.679564 -1.652049 -0.235547
5 -0.131448 -0.131441 -0.043069
6 -0.966899  0.242531 -0.489120

In [31]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
np.unique(data.k1)

array(['one', 'two'], dtype=object)

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data.drop_duplicates(keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [39]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'    
} # this is a mapping

In [41]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [42]:
data['animal'] = lowercased.map(meat_to_animal)

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [2]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [48]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [52]:
data.columns.map(transform)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [3]:
data.rename({'Ohio' : 'Oooo'})

          one  two  three  four
Oooo        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [4]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11